# Лабораторна робота №2. Рядки. Завдання 4
# Виконала: Іващук Евеліна

# Завдання 4. В тексті замінити букву (а) буквою (о). Підрахувати кількість
# замін. Підрахувати, скільки символів в рядку.

# Вводимо текст з клавіатури (літери "а" та "о" - українські)
text = input("Enter the text: ")

# Кількість замін дорівнює кількості літер "а" у тексті
count = text.count("а")

# Замінюємо всі літери "а" на "о"
new_text = text.replace("а", "о")

# Функція len() повертає кількість символів у рядку (разом із пробілами)
length = len(new_text)

print("New text:", new_text)
print("Number of replacements:", count)
print("Number of characters in the string:", length)
