# Лабораторна робота №2. Рядки. Завдання 11
# Виконала: Іващук Евеліна

# Завдання 11. Дано рядок на англійській мові, що містить текст (до тисячі
# слів). Написати програму для підрахунку голосних літер в тексті. Програма
# має бути нечутлива до регістру.

# Вводимо текст з клавіатури
text = input("Enter the text: ")

vowels = "aeiou"    # голосні літери англійського алфавіту

count = 0    # лічильник голосних

# Переводимо текст у нижній регістр, щоб великі й малі літери рахувалися однаково,
# і перебираємо його посимвольно
for char in text.lower():
    # Оператор in перевіряє, чи входить символ до рядка vowels
    if char in vowels:
        count += 1

print("Number of vowels:", count)
