# Лабораторна робота №2. Рядки. Завдання 9
# Виконала: Іващук Евеліна

# Завдання 9. Дано рядок на англійській мові, що містить текст (до тисячі
# слів). Перетворити рядок так, щоб кожне слово починалося з великої літери.

# Вводимо текст з клавіатури
text = input("Enter the text: ")

new_words = []    # список для перетворених слів

# Розбиваємо текст на слова і обробляємо кожне слово
for word in text.split():
    # Першу літеру слова робимо великою, решту слова залишаємо без змін:
    # word[0] - перший символ, word[1:] - усі символи, починаючи з другого
    new_word = word[0].upper() + word[1:]
    new_words.append(new_word)

# Метод join() з'єднує слова зі списку в один рядок через пробіл
new_text = " ".join(new_words)

print("New text:", new_text)
