# Лабораторна робота №2. Рядки. Завдання 2
# Виконала: Іващук Евеліна

# Завдання 2. В тексті замінити всі двокрапки (:) знаком відсотка (%).
# Підрахувати кількість замін.

# Вводимо текст з клавіатури
text = input("Enter the text: ")

# Кількість замін дорівнює кількості двокрапок у тексті.
# Метод count() рахує, скільки разів символ зустрічається в рядку.
count = text.count(":")

# Метод replace() повертає новий рядок, у якому всі ":" замінено на "%"
new_text = text.replace(":", "%")

print("New text:", new_text)
print("Number of replacements:", count)
